In [1]:
# Importing Libraries
import os
from dotenv import load_dotenv
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Create .env file
# Inside the .env, set the environment variables and it's values

# Load Environment Variables
load_dotenv()

True

In [3]:
# Getting the values from the env variables
db_pass = os.getenv("PASS_DB")
user = os.getenv("USER")

In [4]:
# Creating dataframe to be converted
df_bands = pd.DataFrame({"band": ["Linking Park", "Foo Fighters", "Sabbaton"], "style": ["Nu Rock", "Rock", "Metal"]})

df_bands

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal

In [5]:
# Creating the engine of the DB
engine = create_engine(f"postgresql://postgres:{db_pass}@localhost/postgres")

df_bands.to_sql("bands", engine, if_exists="replace", index=False)

3

In [6]:
# Setting a SQL query
query = """
SELECT *
FROM bands
"""

# Reading the data from the query
pd.read_sql(query, engine)

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal

In [7]:
# Storing in a dataframe
df = pd.read_sql(query, engine)

df

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal

In [9]:
# Using psycopg2, no need for pandas
connection = psycopg2.connect(
    host = "localhost",
    database = "postgres",
    user = "postgres",
    password = db_pass
)

cursor = connection.cursor()

# SQL command
query = """
INSERT INTO bands (band, style) VALUES (%s, %s)
"""

# Executing query
cursor.execute(query, ("Green Day", "Punk"))

# Commiting 
connection.commit()

In [10]:
# Setting a SQL query
query = """
SELECT *
FROM bands
"""

# Reading the data from the query
pd.read_sql(query, engine)

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal
3     Green Day     Punk

In [11]:
connection.close()